import pytest


@pytest.fixture
def number_list():
    """ПРИМЕР фикстуры c функцией "max и sum" для практики 10_2_6"""
    return [1, 2, 3, 4, 5]


@pytest.fixture
def numbers():
    """ПРИМЕР фикстуры для практики 10_2_6"""
    return "321"


@pytest.fixture
def letters():
    """ПРИМЕР фикстуры для практики 10_2_6"""
    return "olleh"


# **********************live_10_2_26_04_2026***********************************
# -----------------------------------------
# при размещении в модуле сonftest.py тесты фикстур будут доступны
# всем модулям, можно использовать одни и те же тесты в разных файлах


# можно размещать в этом же модуле (файле test_main.py) тогда тесты фикстур будут доступны только этому модулю
@pytest.fixture(scope="function")  # или (scope="module") или (scope="session")
def prices():
    return [100, 200, 300]


# -----------------------------------------


# ******************************************************************************
# **********************************9********************************************
# --------------6-7-8-------------------------


@pytest.fixture(scope="function")  # или (scope="module") или (scope="session")
def prices_2():
    yield [100, 200, 300]
    print(1231)


# -----------------------------------------


# ******************************************************************************
