"""
Библиотека re
"""

import re

# Поиск всех цен в строке
text = "The price of the product is $100.50"
numbers = re.findall(r"\d+\.\d+", text)
print(numbers)

# >>> ['100.50']

# re.findall() ищет все совпадения с заданным регулярным выражением: r"\d+\.\d+"
# в строке: text
# и возвращает их в виде списка строк.


# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --
print("\n--  --  --  --  --  --  --\n")
# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --


# import re

text = "Иван купил 3 яблока, а Маша — 15 груш"
# Ищем все последовательности цифр
result = re.findall(r"\d+", text)

print(result)
# >>>  ['3', '15']


# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --
print("\n--  --  --  --  --  --  --\n")
# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --


# import re

text = "Цены: $10, $25, $100"
# Ищем числа, которые идут строго после знака доллара
result = re.findall(r"\$(\d+)", text)

print(result)
# >>> ['10', '25', '100'] (знак $ отсеялся благодаря скобкам)


# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --
print("\n--  -- с использованием флагов --  --\n")
# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --


# import re

# Поиск всех цен в строке с использованием флагов
text = "Цена товара составляет $100.50"
# Флаг re.IGNORECASE не требуется в данном случае,
# но демонстрирует использование флагов
numbers = re.findall(r"\d+\.\d+", text, re.IGNORECASE)
print(numbers)

# >>> ['100.50']

# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --
print("\n--  --  -- ЗАДАЧА --  --  --\n")
# --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --  --


"""
Задача
Найти все цены в строке и вернуть их в виде списка.Цены могут быть указаны в различных валютах
(например, $, €, £) и должны состоять из целой и дробной части, разделенных точкой.
Пример строки:
The prices are $100.50, €200.75, and £300.99.
"""

# import re

# Пример строки с ценами
text = "The prices are $100.50, €200.75, and £300.99."

result = re.findall(r"[$€£]\d+\.\d+", text)

print(result)

# >>> ['$100.50', '€200.75', '£300.99']
